a = 956 #Создаю переменную и присваиваю ее значение 
b = 10 #Создаю переменную и присваиваю ее значение 
c = a + b #Создаю переменную и присваиваю сумму
print (c)#вывожу переменную
c = a-b #Создаю переменную и присваиваю разность
print (c)#вывожу переменную
c = a*b #Создаю переменную и присваиваю произведение
print (c)#вывожу переменную
c = a/b #Создаю переменную и присваиваю частное
print (c)#вывожу переменную
c = a//b #Создаю переменную и присваиваю
print (c)#вывожу переменную
c = a**b #Создаю переменную и присваиваю
print (c)#вывожу переменную
z1 = a // 100
z2 = a // 10 % 10
z3 = a % 10
print (z1,z2,z3)
